АлогистикТест2/src/DataProcessors/ВыгрузкаИзАЛогистиК_вТД/ВыгрузкаИзАЛогистиК_вТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаИзАЛогистиК_вТД</name>
</mdclass:DataProcessor>

АлогистикТест2/src/InformationRegisters/алк_ГрадацииСечений/алк_ГрадацииСечений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ГрадацииСечений</name>
  <resources>
    <name>Градация</name>
    <type>
      <types>CatalogRef.Градации</types>
    </type>
  </resources>
  <dimensions>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_ОценкаСырья/алк_ОценкаСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ОценкаСырья</name>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоКондиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборШтабеля</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузитьЕРП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтанцияОтправления</name>
      <type>
        <types>CatalogRef.алк_ЛогистическиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТранспортировки</name>
      <type>
        <types>EnumRef.алк_ВидыТранспортировки</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВагона</name>
      <comment>Номер вагона/автомобиля</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <comment>Номер ЖД накладной</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Некондиция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Градация</name>
      <type>
        <types>CatalogRef.Градации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/DataProcessors/ВыгрузкаИзАЛогистиК_вТД/Forms/ФормаВыгрузкаРеализации/Module.bsl
&НаКлиенте
Процедура ЗаполнитьДокументамиОценкиЗаПериод(Команда)
	ЗаполнитьДокументамиОценкиЗаПериодНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументамиОценкиЗаПериодНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ОценкаСырьяПродукция.Ссылка КАК ДокументОценки,
	|	алк_ОценкаСырьяПродукция.Ссылка.ДатаС,
	|	алк_ОценкаСырьяПродукция.Ссылка.ДатаПо,
	|	алк_ОценкаСырьяПродукция.ВидТранспортировки,
	|	СУММА(алк_ОценкаСырьяПродукция.Объем) КАК Объем,
	|	СУММА(алк_ОценкаСырьяПродукция.Сумма) КАК Сумма,
	|	алк_ОценкаСырьяПродукция.Ссылка.Производитель,
	|	ИСТИНА КАК Выгрузить
	|ИЗ
	|	Документ.алк_ОценкаСырья.Продукция КАК алк_ОценкаСырьяПродукция
	|ГДЕ
	|	алк_ОценкаСырьяПродукция.Ссылка.Проведен
	|	И алк_ОценкаСырьяПродукция.Ссылка.Дата >= &ДатаНачало
	|	И алк_ОценкаСырьяПродукция.Ссылка.Дата <= &ДатаКонец
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ОценкаСырьяПродукция.Ссылка.Производитель,
	|	алк_ОценкаСырьяПродукция.Ссылка.ДатаС,
	|	алк_ОценкаСырьяПродукция.ВидТранспортировки,
	|	алк_ОценкаСырьяПродукция.Ссылка.ДатаПо,
	|	алк_ОценкаСырьяПродукция.Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНачало", ПериодВыгрузки.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонец", КонецДня(ПериодВыгрузки.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выгружаемое.Загрузить(РезультатЗапроса.Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	ВыгрузитьВФайлНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВФайлНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ОценкаСырьяПродукция.Ссылка.Номер КАК НомерДок,
	|	алк_ОценкаСырьяПродукция.Ссылка.ДатаС,
	|	алк_ОценкаСырьяПродукция.Ссылка.ДатаПо,
	|	алк_ОценкаСырьяПродукция.Партия.Номер КАК Номер,
	|	алк_ОценкаСырьяПродукция.Ссылка.Дата КАК ДатаДок,
	|	ПРЕДСТАВЛЕНИЕ(алк_ОценкаСырьяПродукция.Сорт) КАК Сорт,
	|	ПРЕДСТАВЛЕНИЕ(алк_ОценкаСырьяПродукция.Градация) КАК Градация,
	|	ПРЕДСТАВЛЕНИЕ(алк_ОценкаСырьяПродукция.Ссылка.Производитель) КАК Производитель,
	|	СУММА(алк_ОценкаСырьяПродукция.Объем) КАК Объем,
	|	СУММА(алк_ОценкаСырьяПродукция.Объем) КАК ОбъемКонтроль,
	|	алк_ОценкаСырьяПродукция.Цена,
	|	алк_ОценкаСырьяПродукция.Сумма
	|ИЗ
	|	Документ.алк_ОценкаСырья.Продукция КАК алк_ОценкаСырьяПродукция
	|ГДЕ
	|	алк_ОценкаСырьяПродукция.Ссылка.Проведен
	|	И алк_ОценкаСырьяПродукция.Сумма <> 0
	|	И алк_ОценкаСырьяПродукция.Партия ССЫЛКА Документ.алк_ПриемкаЛесопродукции
	|	И алк_ОценкаСырьяПродукция.Ссылка В(&СпСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ОценкаСырьяПродукция.Партия.Номер,
	|	алк_ОценкаСырьяПродукция.Ссылка.Номер,
	|	алк_ОценкаСырьяПродукция.Ссылка.ДатаС,
	|	алк_ОценкаСырьяПродукция.Ссылка.ДатаПо,
	|	алк_ОценкаСырьяПродукция.Ссылка.Дата,
	|	алк_ОценкаСырьяПродукция.Цена,
	|	алк_ОценкаСырьяПродукция.Сумма,
	|	ПРЕДСТАВЛЕНИЕ(алк_ОценкаСырьяПродукция.Сорт),
	|	ПРЕДСТАВЛЕНИЕ(алк_ОценкаСырьяПродукция.Градация),
	|	ПРЕДСТАВЛЕНИЕ(алк_ОценкаСырьяПродукция.Ссылка.Производитель)";
	
	СпСсылка = Новый СписокЗначений;
	
	Для каждого стрВыгрузить Из Выгружаемое Цикл
		
		Если Не стрВыгрузить.Выгрузить Тогда
			Продолжить;	
		КонецЕсли; 
		
		СпСсылка.Добавить(стрВыгрузить.ДокументОценки);
		
	КонецЦикла; 
	
	
	Запрос.УстановитьПараметр("СпСсылка", СпСсылка);
	
	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить()
	
	Таблица_1 = РезультатЗапроса.Выгрузить();
	Таблица_1.Очистить();
	Таблица_1.Колонки.Добавить("Количество", новый ОписаниеТипов("Число", новый КвалификаторыЧисла(15,0)));
	Таблица_1.Колонки.Добавить("Сечение", новый ОписаниеТипов("Число", новый КвалификаторыЧисла(15,0)));
	Таблица_1.Колонки.Добавить("МылкиЛП", новый ОписаниеТипов("Булево"));
	Таблица_1.Колонки.Добавить("Товар", новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	
	Для каждого стрТ Из Выгружаемое Цикл
		
		Если Не СтрТ.Выгрузить Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЦЛП,
		|	ИСТИНА КАК МылкиЛП,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка КАК Партия,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Номенклатура,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Порода,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сорт,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Длина,
		|	алк_ГрадацииСечений.Градация,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сечение,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Количество,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Объем,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Объем КАК ОбъемКонтроль
		|ИЗ
		|	Документ.алк_ПриемкаЛесопродукции.ПиловочникГОСТ КАК алк_ПриемкаЛесопродукцииПиловочникГОСТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрадацииСечений КАК алк_ГрадацииСечений
		|		ПО алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сечение = алк_ГрадацииСечений.Сечение
		|ГДЕ
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата >= &ДатаС
		|	И алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата <= &ДатаПо
		|	И (алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Производитель = &Производитель
		|			ИЛИ алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Производитель = &ПоВсемПроизводителям)
		|	И (алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.СтанцияОтправления = &СтанцияОтправления
		|			ИЛИ алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.СтанцияОтправления = &ПоВсемСтанциямОтправления)
		|	И НЕ алк_ПриемкаЛесопродукцииПиловочникГОСТ.Основная
		|	И (алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель.Несоответствие = ЛОЖЬ
		|			ИЛИ алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель = &ШтРеквизит)";
		
		Запрос.УстановитьПараметр("ДатаС",	стрТ.ДокументОценки.ДатаС);
		Запрос.УстановитьПараметр("ДатаПо",	КонецДня(стрТ.ДокументОценки.ДатаПо));
		Запрос.УстановитьПараметр("ПоВсемПроизводителям", Не ЗначениеЗаполнено(стрТ.ДокументОценки.Производитель));
		Запрос.УстановитьПараметр("ПоВсемСтанциямОтправления", Не ЗначениеЗаполнено(стрТ.ДокументОценки.СтанцияОтправления));
		Запрос.УстановитьПараметр("Производитель", стрТ.ДокументОценки.Производитель);
		Запрос.УстановитьПараметр("СтанцияОтправления",	стрТ.ДокументОценки.СтанцияОтправления);
		
		Запрос.УстановитьПараметр("ШтРеквизит", Справочники.алк_Штабели.НайтиПоКоду("000000007")); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Таблица_2 = РезультатЗапроса.Выгрузить();
		
		//
		Таблица_2.Колонки.Добавить("Цена", новый ОписаниеТипов("Число", новый КвалификаторыЧисла(15,2)));
		Таблица_2.Колонки.Добавить("Сумма", новый ОписаниеТипов("Число", новый КвалификаторыЧисла(15,2)));
		
		Таблица_2.Свернуть("Партия, Номенклатура, Порода, Сорт, Длина, Градация, Сечение, Цена", "Сумма, Количество, Объем, ОбъемКонтроль");
		
		Для каждого стрПрод Из стрТ.ДокументОценки.Продукция Цикл
			
			м1 = Таблица_2.НайтиСтроки(Новый Структура("Партия, Номенклатура, Порода, Сорт, Длина, Градация", стрПрод.Партия, стрПрод.Номенклатура, стрПрод.Порода, стрПрод.Сорт, стрПрод.Длина, стрПрод.Градация));
			
			ОбъемМ = ИтогПоКолонкеМассива(м1, "Объем");
			
			если ОбъемМ <> стрПрод.Объем тогда
				Сообщить("Ошибка при выгрузке партии: " + стрПрод.Партия + " ("+стрПрод.Партия.производитель+") . Объем в документе ""оценка"": " + стрПрод.Объем + ", не равен объему в приемке: " + ОбъемМ);
			конецесли;
			
			Если м1.Количество() <> 0 Тогда
				А = "ОК";	
			КонецЕсли; 
			
			С = 0;
			Для каждого стрМассиваСтрок Из м1 Цикл
				
				стрМассиваСтрок.Цена  = стрПрод.Цена;
				стрМассиваСтрок.Сумма = стрМассиваСтрок.Объем / ОбъемМ * стрПрод.Сумма;
				С = С + стрМассиваСтрок.Сумма;
				
			КонецЦикла; 
			
			Если С <> 0 Тогда
				
				м1[0].Сумма = м1[0].Сумма + стрПрод.Сумма - С;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Таблица_2.Свернуть("Партия, Номенклатура, Порода, Сорт, Длина, Градация, Сечение, Цена", "Сумма, Количество, Объем, ОбъемКонтроль");
		
		Для каждого стрТ_2 Из Таблица_2 Цикл
			
			НоваяСтрока = Таблица_1.Добавить();
			НоваяСтрока.Производитель = стрТ.ДокументОценки.Производитель.Наименование;
			НоваяСтрока.НомерДок = стрТ.ДокументОценки.номер;
			НоваяСтрока.ДатаДок = стрТ.ДокументОценки.Дата;
			НоваяСтрока.ДатаС = стрТ.ДокументОценки.ДатаС;
			НоваяСтрока.ДатаПо = стрТ.ДокументОценки.ДатаПо;
			
			НоваяСтрока.МылкиЛП = Истина;
			стрНомер = стрТ_2.Партия.Номер;
			НоваяСтрока.Номер = "ЛК-" + Прав(стрНомер, СтрДлина(стрНомер) - 3);
			
			НоваяСтрока.Сорт = сокрлп(стрТ_2.Сорт);
			НоваяСтрока.Сечение = Строка(стрТ_2.Сечение.ДиаметрММ/10);
			НоваяСтрока.Градация = сокрлп(стрТ_2.Градация);
			
			НоваяСтрока.Объем = стрТ_2.Объем;
			НоваяСтрока.ОбъемКонтроль = стрТ_2.ОбъемКонтроль;
			НоваяСтрока.Цена = стрТ_2.Цена;
			НоваяСтрока.Сумма = стрТ_2.Сумма;
			НоваяСтрока.Количество = стрТ_2.Количество;
			
			НоваяСтрока.Товар = стрТ_2.Порода.СокращенноеНаименование + " " + СтрЗаменить(Строка(стрТ_2.Длина.ДлинаММ/1000), ".", ",");
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	Таблица_1.Свернуть("Производитель,НомерДок,ДатаДок,ДатаС,ДатаПо,Номер,Товар, Сорт,Сечение,Градация,Цена,МылкиЛП", "Объем, ОбъемКонтроль, Сумма, Количество");
	
	ЗначениеВФайл("\\rfp01-srv023\Files\1C\Exchange\ALK_TD\ALK_TDsale_1.txt", Таблица_1);
	
КонецПроцедуры

Функция ИтогПоКолонкеМассива(Массив,Колонка)Экспорт
	
	Результат=0;
	Для Каждого Стр из Массив Цикл
		Результат=Результат+Стр[Колонка];
	КонецЦикла;
	Возврат Результат;
	
КонецФункции


&НаСервере
Процедура ВыгрузитьВФайл2НаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ОценкаСырьяПродукция.Ссылка.Номер КАК НомерДок,
	|	алк_ОценкаСырьяПродукция.Ссылка.ДатаС,
	|	алк_ОценкаСырьяПродукция.Ссылка.ДатаПо,
	|	алк_ОценкаСырьяПродукция.Партия.Номер КАК Номер,
	|	алк_ОценкаСырьяПродукция.Ссылка.Дата КАК ДатаДок,
	|	ПРЕДСТАВЛЕНИЕ(алк_ОценкаСырьяПродукция.Сорт) КАК Сорт,
	|	ПРЕДСТАВЛЕНИЕ(алк_ОценкаСырьяПродукция.Градация) КАК Градация,
	|	ПРЕДСТАВЛЕНИЕ(алк_ОценкаСырьяПродукция.Ссылка.Производитель) КАК Производитель,
	|	СУММА(алк_ОценкаСырьяПродукция.Объем) КАК Объем,
	|	СУММА(алк_ОценкаСырьяПродукция.Объем) КАК ОбъемКонтроль,
	|	алк_ОценкаСырьяПродукция.Цена,
	|	алк_ОценкаСырьяПродукция.Сумма
	|ИЗ
	|	Документ.алк_ОценкаСырья.Продукция КАК алк_ОценкаСырьяПродукция
	|ГДЕ
	|	алк_ОценкаСырьяПродукция.Ссылка.Проведен
	|	И алк_ОценкаСырьяПродукция.Сумма <> 0
	|	И алк_ОценкаСырьяПродукция.Партия ССЫЛКА Документ.алк_ПриемкаЛесопродукции
	|	И алк_ОценкаСырьяПродукция.Ссылка В(&СпСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ОценкаСырьяПродукция.Партия.Номер,
	|	алк_ОценкаСырьяПродукция.Ссылка.Номер,
	|	алк_ОценкаСырьяПродукция.Ссылка.ДатаС,
	|	алк_ОценкаСырьяПродукция.Ссылка.ДатаПо,
	|	алк_ОценкаСырьяПродукция.Ссылка.Дата,
	|	алк_ОценкаСырьяПродукция.Цена,
	|	алк_ОценкаСырьяПродукция.Сумма,
	|	ПРЕДСТАВЛЕНИЕ(алк_ОценкаСырьяПродукция.Сорт),
	|	ПРЕДСТАВЛЕНИЕ(алк_ОценкаСырьяПродукция.Градация),
	|	ПРЕДСТАВЛЕНИЕ(алк_ОценкаСырьяПродукция.Ссылка.Производитель)";
	
	СпСсылка = Новый СписокЗначений;
	
	Для каждого стрВыгрузить Из Выгружаемое Цикл
		
		Если Не стрВыгрузить.Выгрузить Тогда
			Продолжить;	
		КонецЕсли; 
		
		СпСсылка.Добавить(стрВыгрузить.ДокументОценки);
		
	КонецЦикла; 
	
	
	Запрос.УстановитьПараметр("СпСсылка", СпСсылка);
	
	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить()
	
	Таблица_1 = РезультатЗапроса.Выгрузить();
	Таблица_1.Очистить();
	Таблица_1.Колонки.Добавить("Количество", новый ОписаниеТипов("Число", новый КвалификаторыЧисла(15,0)));
	Таблица_1.Колонки.Добавить("Сечение", новый ОписаниеТипов("Число", новый КвалификаторыЧисла(15,0)));
	Таблица_1.Колонки.Добавить("МылкиЛП", новый ОписаниеТипов("Булево"));
	Таблица_1.Колонки.Добавить("Товар", новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	
	Для каждого стрТ Из Выгружаемое Цикл
		
		Если Не СтрТ.Выгрузить Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЦЛП,
		|	ИСТИНА КАК МылкиЛП,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка КАК Партия,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Номенклатура,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Порода,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сорт,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Длина,
		|	алк_ГрадацииСечений.Градация,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сечение,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Количество,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Объем,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Объем КАК ОбъемКонтроль
		|ИЗ
		|	Документ.алк_ПриемкаЛесопродукции.ПиловочникГОСТ КАК алк_ПриемкаЛесопродукцииПиловочникГОСТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрадацииСечений КАК алк_ГрадацииСечений
		|		ПО алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сечение = алк_ГрадацииСечений.Сечение
		|ГДЕ
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата >= &ДатаС
		|	И алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата <= &ДатаПо
		|	И (алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Производитель = &Производитель
		|			ИЛИ алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Производитель = &ПоВсемПроизводителям)
		|	И (алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.СтанцияОтправления = &СтанцияОтправления
		|			ИЛИ алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.СтанцияОтправления = &ПоВсемСтанциямОтправления)
		|	И НЕ алк_ПриемкаЛесопродукцииПиловочникГОСТ.Основная
		|	И (алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель.Несоответствие = ЛОЖЬ
		|			ИЛИ алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель = &ШтРеквизит)
		|	И алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка В(&Ссылки)";
		
		Запрос.УстановитьПараметр("ДатаС",	стрТ.ДокументОценки.ДатаС);
		Запрос.УстановитьПараметр("ДатаПо",	КонецДня(стрТ.ДокументОценки.ДатаПо));
		Запрос.УстановитьПараметр("ПоВсемПроизводителям", Не ЗначениеЗаполнено(стрТ.ДокументОценки.Производитель));
		Запрос.УстановитьПараметр("ПоВсемСтанциямОтправления", Не ЗначениеЗаполнено(стрТ.ДокументОценки.СтанцияОтправления));
		Запрос.УстановитьПараметр("Производитель", стрТ.ДокументОценки.Производитель);
		Запрос.УстановитьПараметр("СтанцияОтправления",	стрТ.ДокументОценки.СтанцияОтправления);
		
		МассивСсылки = Новый Массив;
		
		Для каждого Стр Из стрТ.ДокументОценки.Продукция Цикл
			
			МассивСсылки.Добавить(Стр.Партия); 		
		
		КонецЦикла; 
		
		Запрос.УстановитьПараметр("Ссылки", МассивСсылки);
		
		Запрос.УстановитьПараметр("ШтРеквизит", Справочники.алк_Штабели.НайтиПоКоду("000000007")); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Таблица_2 = РезультатЗапроса.Выгрузить();
		
		//
		Таблица_2.Колонки.Добавить("Цена", новый ОписаниеТипов("Число", новый КвалификаторыЧисла(15,2)));
		Таблица_2.Колонки.Добавить("Сумма", новый ОписаниеТипов("Число", новый КвалификаторыЧисла(15,2)));
		
		Таблица_2.Свернуть("Партия, Номенклатура, Порода, Сорт, Длина, Градация, Сечение, Цена", "Сумма, Количество, Объем, ОбъемКонтроль");
		
		Для каждого стрПрод Из стрТ.ДокументОценки.Продукция Цикл
			
			м1 = Таблица_2.НайтиСтроки(Новый Структура("Партия, Номенклатура, Порода, Сорт, Длина, Градация", стрПрод.Партия, стрПрод.Номенклатура, стрПрод.Порода, стрПрод.Сорт, стрПрод.Длина, стрПрод.Градация));
			
			ОбъемМ = ИтогПоКолонкеМассива(м1, "Объем");
			
			если ОбъемМ <> стрПрод.Объем тогда
				Сообщить("Ошибка при выгрузке партии: " + стрПрод.Партия + " ("+стрПрод.Партия.производитель+") . Объем в документе ""оценка"": " + стрПрод.Объем + ", не равен объему в приемке: " + ОбъемМ);
			конецесли;
			
			Если м1.Количество() <> 0 Тогда
				А = "ОК";	
			КонецЕсли; 
			
			С = 0;
			Для каждого стрМассиваСтрок Из м1 Цикл
				
				стрМассиваСтрок.Цена  = стрПрод.Цена;
				стрМассиваСтрок.Сумма = стрМассиваСтрок.Объем / ОбъемМ * стрПрод.Сумма;
				С = С + стрМассиваСтрок.Сумма;
				
			КонецЦикла; 
			
			Если С <> 0 Тогда
				
				м1[0].Сумма = м1[0].Сумма + стрПрод.Сумма - С;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Таблица_2.Свернуть("Партия, Номенклатура, Порода, Сорт, Длина, Градация, Сечение, Цена", "Сумма, Количество, Объем, ОбъемКонтроль");
		
		Для каждого стрТ_2 Из Таблица_2 Цикл
			
			НоваяСтрока = Таблица_1.Добавить();
			НоваяСтрока.Производитель = стрТ.ДокументОценки.Производитель.Наименование;
			НоваяСтрока.НомерДок = стрТ.ДокументОценки.номер;
			НоваяСтрока.ДатаДок = стрТ.ДокументОценки.Дата;
			НоваяСтрока.ДатаС = стрТ.ДокументОценки.ДатаС;
			НоваяСтрока.ДатаПо = стрТ.ДокументОценки.ДатаПо;
			
			НоваяСтрока.МылкиЛП = Истина;
			стрНомер = стрТ_2.Партия.Номер;
			НоваяСтрока.Номер = "ЛК-" + Прав(стрНомер, СтрДлина(стрНомер) - 3);
			
			НоваяСтрока.Сорт = сокрлп(стрТ_2.Сорт);
			НоваяСтрока.Сечение = Строка(стрТ_2.Сечение.ДиаметрММ/10);
			НоваяСтрока.Градация = сокрлп(стрТ_2.Градация);
			
			НоваяСтрока.Объем = стрТ_2.Объем;
			НоваяСтрока.ОбъемКонтроль = стрТ_2.ОбъемКонтроль;
			НоваяСтрока.Цена = стрТ_2.Цена;
			НоваяСтрока.Сумма = стрТ_2.Сумма;
			НоваяСтрока.Количество = стрТ_2.Количество;
			
			НоваяСтрока.Товар = стрТ_2.Порода.СокращенноеНаименование + " " + СтрЗаменить(Строка(стрТ_2.Длина.ДлинаММ/1000), ".", ",");
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	Таблица_1.Свернуть("Производитель,НомерДок,ДатаДок,ДатаС,ДатаПо,Номер,Товар, Сорт,Сечение,Градация,Цена,МылкиЛП", "Объем, ОбъемКонтроль, Сумма, Количество");
	
	ЗначениеВФайл("\\rfp01-srv023\Files\1C\Exchange\ALK_TD\ALK_TDsale_1.txt", Таблица_1);

КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьВФайл2(Команда)
	ВыгрузитьВФайл2НаСервере();
КонецПроцедуры
